#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	//TODO: Вставить содержимое обработчика
	Параметры.Свойство("ДатаСмены", Датасмены);
	Параметры.Свойство("Спецификация", Спецификация);
	КонтрольнаяТочка = ПараметрыСеанса.оуп_ТекущаяКонтрольнаяТочка;
	
	если 	не ЗначениеЗаполнено(ДатаСмены) или
			не ЗначениеЗаполнено(Спецификация) или
			не ЗначениеЗаполнено(КонтрольнаяТочка)	тогда
		Отказ = Истина;
		возврат;		
	КонецЕсли;
	
	Склад = КонтрольнаяТочка.Склад;
	
	ЗаполнитьПараметрыСписков();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПараметрыСписков()
	МассивТаблиц = новый Массив;
	МассивТаблиц.Добавить("Выпуск");
	МассивТаблиц.Добавить("Материалы");
	МассивТаблиц.Добавить("Произведено");
	
	для Каждого Таблица из МассивТаблиц Цикл
		УстановитьПареметрыСписка(Таблица);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПареметрыСписка(Имятаблицы)
	ЭтотОбъект[Имятаблицы].Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	ЭтотОбъект[Имятаблицы].Параметры.УстановитьЗначениеПараметра("ДатаСмены", ДатаСмены);	
КонецПроцедуры


#КонецОбласти