Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр оуп_ПартииВыпускаПродукции
	Движения.оуп_ПартииВыпускаПродукции.Записывать = Истина;
	Движение = Движения.оуп_ПартииВыпускаПродукции.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.ДатаСмены = ДатаСмены;
	Движение.Спецификация = Спецификация;
	Движение.Склад = Склад;
	Движение.КоличествоСырье = Количество;

	// регистр оуп_ДанныеМатериаловВыпуска
	Движения.оуп_ДанныеМатериаловВыпуска.Записывать = Истина;
	Движение = Движения.оуп_ДанныеМатериаловВыпуска.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.ДатаСмены = ДатаСмены;
	Движение.Спецификация = Спецификация;
	Движение.Номенклатура = Номенклатура;
	Движение.Склад = Склад;
	Движение.Количество = Количество;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры