#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	параметры.Свойство("Склад", Склад);
	параметры.Свойство("Организация", Организация);
	если склад.Пустая() или Организация.Пустая() Тогда
		отказ = Истина;
	КонецЕсли;
	ОбновитьОстаткиОрганизации();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Адрес= АдресРезультатаПодбораНаСервере();
	ОповеститьОВыборе(Адрес);	
КонецПроцедуры


#КонецОбласти
//@skip-check module-structure-top-region
#Область ОбработчикиСобытийЭлементовТаблицыФормыОстатки
&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
	ТекДанные = остатки.Получить(ВыбраннаяСтрока);
	Оповещение = новый ОписаниеОповещения("ЗавершениеВводаКоличество", ЭтотОбъект, ТекДанные);
	ПоказатьВводЧисла(Оповещение, 0, "Введите количество", 10, 2);
КонецПроцедуры
#КонецОбласти

//@skip-check module-structure-top-region
#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция АдресРезультатаПодбораНаСервере()
	ТЗ = Подобрано.Выгрузить();
	возврат ПоместитьВоВременноеХранилище(ТЗ, УникальныйИдентификатор);
КонецФункции

&НаСервере
Процедура ОбновитьОстаткиОрганизации() 
	ПараметрыЗапроса = Новый Структура("Склад, Организация", Склад, Организация);
	
	АдресТаблицы = оуп_ПередачаВПереработкуВызовСервера.ПолучитьОстаткиДляПередачиВПереработку(ПараметрыЗапроса);
	Таблица = ПолучитьИзВременногоХранилища(АдресТаблицы);
	ЗначениеВРеквизитФормы(Таблица, "Остатки");
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВводаКоличество(Результат, ДопПараметры) Экспорт
	если Результат = Неопределено Тогда
		возврат;
	КонецЕсли;
	если Результат > ДопПараметры.КоличествоОстаток Тогда
		показатьпредупреждение(, "Превышение количества остатка !");
		возврат;	
	КонецЕсли;
	Отбор = новый Структура("Номенклатура, Серия, КоличествоОстаток");
	ЗаполнитьЗначенияСвойств(Отбор, ДопПараметры);
	
	СтрокиОстатки = остатки.НайтиСтроки(Отбор);
	если СтрокиОстатки.Количество() Тогда
		СтрокиОстатки[0].КоличествоОстаток = ДопПараметры.КоличествоОстаток - Результат;
		СтрокиОстатки[0].ОстатокОрганизации = ДопПараметры.ОстатокОрганизации - Результат;	
	КонецЕсли;
	
	СтрокаПодобрано = Подобрано.Добавить();
	СтрокаПодобрано.Количество = Результат;
	СтрокаПодобрано.Серия = ДопПараметры.Серия;
	СтрокаПодобрано.Номенклатура = ДопПараметры.Номенклатура;
	СтрокаПодобрано.Организация = Организация;
	
	ИтогоПодобрано = Подобрано.Итог("Количество");
	
КонецПроцедуры

#КонецОбласти

