
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.  
	если не параметры.Свойство("ДатаСмены", ДатаСмены) Тогда 
		Отказ = Истина;
	КонецЕсли;
	КонтрольнаяТочка = ПараметрыСеанса.оуп_ТекущаяКонтрольнаяТочка;
	
	если КонтрольнаяТочка.Пустая() Тогда 
		Отказ = Истина;
	КонецЕсли;
	Объект.Склад = КонтрольнаяТочка.Склад;
    ЗаполнитьПараметрыСпискаДокументов();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыСпискаДокументов()

СписокДокументов.Параметры.УстановитьЗначениеПараметра("Организации", оуп_ПриемПродукцииСервер.СписокДоступныхОрганизацийКТ(КонтрольнаяТочка));	
СписокДокументов.Параметры.УстановитьЗначениеПараметра("Склад", Объект.Склад);
СписокДокументов.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДатаСмены));
СписокДокументов.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ДатаСмены));

КонецПроцедуры // ЗаполнитьПараметрыСпискаДокументов()

&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	ЗаполнитьПараметрыСпискаДокументов();
КонецПроцедуры
