
&НаСервере
Процедура НаименованиеПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
	КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьИмя (знач Строка)
	
	//Создаем переменную, в которую поместим все допустимые символы
	ДопустимыеСимволы = "абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯabcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789_";
	ДлинаДС = СтрДлина(ДопустимыеСимволы);
	Символ = СтрДлина(Строка);
	
	//В переменной Контрагент находится строка, из которой нужно убрать недопустимые символы
	//Обойдем каждый символ этой строки, начиная с конца
	Пока Символ>0 Цикл
		Найдено = Ложь;
		
		//Проверим, есть ли этот символ в перечне допустимых.
		//Здесь вместо цикла можно было бы использовать еще функцию Найти()
		Для ДопустимыйСимвол = 1 По ДлинаДС Цикл
			Если Сред(Строка,Символ, 1)=Сред(ДопустимыеСимволы, ДопустимыйСимвол, 1) Тогда
				Найдено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		//Если символ не найден, удаляем его.
		Если Не Найдено ТОгда
			Строка = СтрЗаменить(Строка, Сред(Строка,Символ, 1), "");
		КонецЕсли;
		Символ = Символ-1;
	КонецЦикла;
	
	Возврат Строка;
	
КонецФункции

&НаСервере
Процедура ПредставлениеПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
	Объект.Наименование =СформироватьИмя(Объект.ИмяНаФорме);

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПриИзменении(Элемент)
	ПредставлениеПриИзмененииНаСервере();
КонецПроцедуры
